Revit 2027 API
WireframeBuilder.AddCurve Method
 Add a curve to the shape representation stored in this WireframeBuilder.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddCurve(
	Curve GCurve
)
Public Sub AddCurve (
	GCurve As Curve
)
public:
void AddCurve(
	Curve^ GCurve
)
member AddCurve :
        GCurve : Curve -> unit
Parameters
GCurve Curve
 The curve to be added.
Exceptions
Exception | Condition
ArgumentException |  GCurve is not acceptable for a wireframe shape representation.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WireframeBuilder Class
Autodesk.Revit.DB Namespace